import RecipeDetail from "@/models/RecipeDetail";

export const recipes: RecipeDetail[]  = [
    {
        "id": 0,
        "title": "비건 초콜릿 코코넛 쿠키",
        "intro": "통밀가루가 있다면 비건 초콜릿 코코넛 쿠키 만들어 보세요.쿠키 반죽은 냉동실에 넣어 두고 쿠키를 먹고 싶을 때마다, 구워 보세요!!코코넛 향과 맛을 좋아한다면 비건 초콜릿 코코넛 쿠키는 여러분의 최애 쿠키가 될 거예요. 그냥 먹어도 맛있고 모닝커피와 같이 해도 좋고 식후 디저트로 먹어도 좋아요! 은은한 단맛으로 기분 좋은 달콤함을 느껴보세요.",
        "time": "준비 시간 10분 조리 시간 25분 총 시간 35분 총 분량 쿠키 8개",
        "ingredient": "통밀가루 160g 코코넛 분말 20g 타피오카 전분18g 베이킹파우더 7g 비정제 원당 50g 현미유 30g 소금 1g 두유 60g 초코칩 60g 코코넛 롱슈레드 10g",
        "explanation": "170℃로 오븐을 예열해 주세요.통밀가루, 코코넛 분말, 타피오카 전분, 베이킹파우더, 소금을 체 쳐주세요.두유와 비정제 원당을 섞다가 현미유를 넣고 잘 섞어 주세요.액체 재료와 가루 재료를  섞어 주세요. 점점 한 덩어리로 뭉칠 거예요. 어느 정도 뭉치면 초코칩과 코코넛 롱슈레드를 넣고 한 덩어리로 만들어 주세요.반죽을 냉장실에 40분간 넣어 주세요.반죽을 5cm 아이스크림 스쿱으로 팬닝한 후 장식용 코코넛 채를 올려 주세요. 20분 정도 굽다가 오븐 팬 위치를 바꾸고 5분을 마저 구워주세요. ※  온도 사양에 따라 굽는 시간이 달라요.", 
        "img": "https://tossibaking.s3.ap-northeast-2.amazonaws.com/cookies2.jpeg",
    },
    {
        "id": 2,
        "intro":"",
        "title":"비건 글루텐 프리  오트밀 초콜릿 칩 쿠키",
        "time":"",
        "explanation":"",
        "img":"",
        "ingredient":""
    },

  ];